//バブルソート
//一番左から順に隣と比較していき、隣り合う要素の大小を入れ替えていくことによって並び替えを行う
int [] data = { 
  15, 1, 93, 52, 66, 31, 87, 0, 42, 77, 46, 24, 99, 10, 19, 36, 27, 4, 58, 76, 2, 81, 50, 102, 33, 94, 20, 14, 80, 82, 49, 41, 12, 143, 121, 7, 111, 100, 60, 55, 108, 34, 150, 103, 109, 130, 25, 54, 57, 159, 136, 110, 3, 167, 119, 72, 18, 151, 105, 171, 160, 144, 85, 201, 193, 188, 190, 146, 210, 211, 63, 207
}; 

// ここで小さい順に並べ替える！
int put; 
for (int j=0; j<data.length-1; j++) {
  for (int i=0; i<data.length-1; i++) {
    if (data[i]-data[i+1]>0) {
      put=data[i+1];
      data[i+1]=data[i];
      data[i]=put;
    }
  }
}

data=reverse(sort(data));//小さい順に並べちゃったから逆に並び替える
for (int i=0; i<data.length; i++) {
  print(data[i]);
}

